execution_cloud.yml
---
execution:
- concurrency: 1000
  hold-for: 8m
  ramp-up: 2m
  locations:
    eu-west-1: 1
    eu-west-1: 2
    eu-west-3: 1
  scenario: Purchase Flight
scenarios:
  Purchase Flight:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com/
    - label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php
      body:
        fromPort: Paris
        toPort: Buenos Aires

modules:
  blazemeter:
    workspace: 109682
    project: 302113
    test: Performance Test 1K
    report-name: Performance 1K