execution_cloud.yml
---
execution:
- concurrency: 400
  hold-for: 8m
  ramp-up: 2m
  locations:
    us-east-1: 1
    us-west-1: 2
  scenario: Purchase Flight
scenarios:
  Purchase Flight:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com/
    - label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php
      body:
        fromPort: Paris
        toPort: Buenos Aires

services:
- module: shellexec
  prepare:  
  - git_commit_id=$(git rev-parse HEAD)

modules:
  blazemeter:
    test: Load Test
    report-name: ${git_commit_id}