execution_cloud.yml
---
execution:
- concurrency: 400
  hold-for: 8m
  ramp-up: 2m
  locations:
    eu-west-1: 1
    eu-west-1: 2
  scenario: Purchase Flight
scenarios:
  Purchase Flight:
    requests:
    - label: blazedemo
      method: GET
      url: http://blazedemo.com/
    - label: reserve
      method: POST
      url: http://blazedemo.com/reserve.php
      body:
        fromPort: Paris
        toPort: Buenos Aires

modules:
  blazemeter:
    test: Blazedemo
    report-name: Blazedemo